<?php
/**
 * ファイル名：constants_regx.php
 * 概要：ECサイトの正規式用の定数の定義
 *
 * 作成者：shilei  
 * 作成日：2011/12/30
 * 変更履歴：
 */

/**
 * 電話番号の正規式
 */
//define ('TEL_REG', '/^(([0-9]{8,12})|([0-9]{3,4}\-[0-9]{3,4}\-[0-9]{3,4})|([0-9]{3,4}\-[0-9]{3,8}))$/i');
define ('TEL_REG', '/^[0-9]{8,12}$/i');
/**
 * Mobile番号の正規式
 */
define ('MOBILE_REG', '/^[0-9]{11}$/i');
/**
 * ZIPの正規式
 */
define ('ZIP_REG', '/^[0-9]{6}$/i');
/**
 * English name 正規式
 */
define ('ENGLISH_NAME', '/^[\w?\s?]*$/i');
/**
 * PASSWORDの正規式
 */
define ('PASSWORD_REG', '/^[0-9a-zA-Z]{6,16}$/i');
/**
 * 価格の正規式
 */
define ('PRICE_REG', '((^\d{1}$)|(^[0-9]{1}\.\d{1,2}$)|(^[1-9]{1}\d{0,7}\.\d{1,2}$)|(^[1-9]{1}\d{0,7}$))');
/**
 * クーポン番号の正規式
 */
define ('COUPON_CODE_REG', '/^[0-9a-zA-Z]{8}$/i');

?>
